<?php
error_reporting(0);
$id = isset($_GET['id'])?$_GET['id']:'11342412';//房间号
$url = "https://mp.huya.com/cache.php?m=Live&do=profileRoom&roomid=" . $id;
$data = json_decode(file_get_contents($url), 1);
$live = explode("&fm",$data["data"]["stream"]["hls"]["multiLine"][0]["url"])[0];
$live = preg_replace("|ratio=2000&|","",$live);
$con = stream_context_create(['http'=>['method'=>"GET",'header'=>["User-Agent: https://mp.huya.com/",]]]);
$cur = file_get_contents($live,null,$con);
$burl = dirname($live)."/"; 
header('Content-Type: application/vnd.apple.mpegurl');
print_r(preg_replace("/(.*?.ts)/i", $burl."$1",$cur));
/*
一起看-电影
【周星星】星爷经典不间断,11342412
天不生我李淳罡，剑道万古如长夜,11336592
英叔护体 | 林正英搞笑僵尸系列,11342421
【虎牙影院】沈腾经典片放映,11601968
李连杰系列 武打高产王,11342390
【警匪】不会演戏的警察不是好卧底,11352886
流浪地球-第三交通委提醒您,880261
成龙经典武打动作片,11342386
历年贺岁档 笑就完事儿了,11601986
只解沙场为国死，何须马革裹尸还,11601977
【王晶】港风导演代表,11602058
经典之作·金庸群侠篇电影,11342427
周润发电影 小马哥归来        ,11342387
这些都是高智商的罪犯,11352962
甄子丹 我要打十个,11352935
星漢燦爛，幸甚至哉！吴磊赵露思疑商夫妇不要太甜,11336591
变形jin刚，阿威,21059596
【黑帮大片】山鸡哥重现江湖        ,11336719
洪金宝·童年回忆杀,11279251
周星星粤语经典版~,11336587
千面影帝梁家辉,11342429
【五福星】每天都要快乐哦,11282233
刘德华电影_经典系列,11342424
简小熙的直播间,11342399
够劲，就是中国功夫,11352941
搞笑恐怖类 弹幕护体,11601960
经典港剧笑嘻嘻,11352965
Han国高分动作片 刺激过瘾,11352884
国外谍战片，你看过多少,21059587
海盗还是得看加勒比,21059595
si神来了系列  好怕怕,11352903
朋友，和赵盼儿一起跳支舞吗！？,11336590
飙车的老司机的直播间,11352894
怪兽打架x异形世界：爽就完事了,21059577
港剧最佳拍档 | 许冠英合集,11601972
搞笑喜剧：最佳拍档 开心鬼系列,11342423
【喜剧专场】我们一起找乐子,11602044
《jiang夜》终将至，花开彼岸天,11352885
蜘蛛侠系列·biubiubiu,21059599
巨石强森系列:真肌肉就是爽,21059581
黑帮斗争 黑与白的对峙，情与义的泯灭,11342419
盗墓还得看经典的,21059552
夜色对鲜血痴迷的追随,21059580
【镖行天下】镖在人在,11352969
永远的经典女神,无法超越啊,11352909
【许氏三杰】快来 就差你了,11602033
古墓系列·去冒险吧！,11352913
动作电影来啦,11602077
枪战还是得看他！,21059579
徐峥黄渤双影帝上演黑色幽默,11352876
玄幻剧场·体验另一种生活！,11342414
看完你也学不会系列~,11352945
玄幻专场·国产特效大制作,11352973
杰森·斯坦森:郭达是你吗,21059588
不挤电影院也能笑着过春节！,11352897
全球最烧脑悬疑片 哪部是你的最爱,11352880
【公共汽车电影】秋名山我来了,11279247
橙光游戏改变 我从来没见过这么炸裂的演技！,11602034
百看不厌的救援大片 ！,21059594
大场面战争片:一枚核弹爆炸,21059574
收到！特种部队出发,21059592
那些年的香gang贺岁片,11601971
真正的硬汉007，铁打的詹姆斯邦德！,21059585
【女神系列】邱淑贞 王祖贤 张曼玉        ,11336571
快意江湖：金庸的武侠世界,11342435
牙缝多了根青菜的直播间,11352877
【十一推荐】动作要快，姿势要帅,11602041
永远怀念“黄药师”曾江,11601981
校园热血电影，不比古惑仔差,11352934
怪兽系列 巨蟒和大白鲨来袭,21059554
国产悬疑精选·智商在线,11342395
DC宇宙来啦，有你喜欢的英雄吗？,11342428
刺激到不行的韩版犯罪片,11352974
爱上我的女总裁第27集,11352887
情人节：港片教你追女仔,11602043
法外狂徒张三李四,11601965
海妖的呼唤：火之岛生存战,11602075
可能是目前最好的篮球电影,21059586
【百基争郎】性转版臻环传，16个男人争一个，我大受震撼！,21059578
七夕特辑 没有分手只有丧偶,11352883
世界柸·没比赛也能看电影,11352963
TVB剧场
普通司机小马的直播间,23749096
 看孙悟空唐三藏取西经,23735126
楚汉骄雄-我恨做皇后 但我做刘邦的皇后,23740156
张卫健版西游记-当蜘蛛精看上了齐天大圣,23728660
【鹿鼎记】小春版韦小宝 是你心中最经典的版本吗？,23865080
【天龙八部】最佳版本天龙·97版黄日华超神作,23903123
【刑事侦缉档案】最棒的警匪片系列,23734169
【寻秦记】穿越剧鼻祖·百看不厌的古天乐宣萱CP,23864973
【神雕侠侣】不能超越的杨过和姑姑·古天乐最强出演,23865171
【法证先锋】侦查片天花板 超经典,23863804
【倚天屠龙记】最爱的赵敏永远是黎姿,23734246
【陀枪师姐】永远的陈小生 无法超越的经典,23860039
【洗冤录】节奏贼快·经典TVB剧情·瘦子欧阳震华出演,23903130
【笑傲江湖】吕颂贤就是哪个令狐冲！最被认可的笑傲江湖！,23865142
【使徒行者】正邪相斗 情义两难,23734256
【鉴证实录】天网恢恢，疏而不漏,23903183
【大唐双龙传】爱你恨你，一生一世,23728674
金枝欲孽-宫斗剧才一开山既已是巅峰！,23865036
【创世纪】神预言，剧里的金融地产现在都成真了！,23749083
野蛮亲家血腥对线！,23863796
扫黄先锋·欧阳震华在不能不看,23903196
【妙手仁心】最出色的都市剧之一,23829543
【笑看风云】再无包文龙，再无林贞烈,23865058
【大时代】史上主角疯子最多的片·荡气回肠大时代！,23865161
【梁朝伟版鹿鼎记】梁朝伟和刘德华还能拒绝吗,23734183
射雕之九阴真经-姜大卫 张智霖,23824164
*/
?>